//: [Previous](@previous)

/*:
 :: 타입 캐스팅 ::
 
 
 
 1. 스위프트 타입 캐스팅
 
 인스턴스의 타입을 확인 하는 용도
 클래스의 인스턴스를 부모 혹은 자식 클래스의 타입으로 사용할 수 있는지 확인 하는 용도
 is, as를 사용합니다.
 * 형변환은 'ex. let someDouble = Double(2)'  타입 캐스팅이 아니라 새로운 값을 생성하는 것입니다.
 
 2. 타입확인
 
 is를 사용하여 타입을 확인합니다.
 
 3. 업 캐스팅(Up Casting)
 
 as를 사용하여 부모클래스의 인스턴스로 사용할 수 있도록 컴파일러에게 타입정보를 전환해줍니다.
 Any 혹은 AnyObject로도 타입정보를 변환할 수 있습니다.
 암시적으로 처리되므로 꼭 필요한 경우가 아니라면 생략해도 무방합니다.
 
 4. 다운 캐스팅(Down Casting)
 
 as? 또는 as!를 사용하여 자식 클래스의 인스턴스로 사용할 수 있도록 컴파일러에게 인스턴스의 타입정보를 전환해줍니다.
 
 
 
 A. 조건부 다운 캐스팅
 
 as?를 사용합니다.
 캐스팅에 실패하면, 즉 캐스팅하려는 타입에 부합하지 않는 인스턴스라면 nil을 반환하기 때문에 결과의 타입은 옵셔널 타입입니다.
 
 
 B. 강제 다운 캐스팅
 
 as!를 사용합니다.
 캐스팅에 실패하면, 즉 캐스팅하려는 타입에 부합하지 않는 인스턴스라면 런타임 오류가 발생합니다.
 캐스팅에 성공하면 옵셔널이 아닌 일반 타입을 반환합니다.
 5. 활용
 

 
*/


//: [Next](@next)
